# GetDatumRoofComp

## Description
Gets the datum roof component of the object.

```pascal
FUNCTION GetDatumRoofComp(object : HANDLE) : INTEGER;
```

```python

def vs.GetDatumRoofComp(object):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object. Can be a roof face, roof, Roof Style, or the Roof Preferences.|

## Returns
The index of the datum roof component.

## See Also
VS Functions:
SetDatumRoofComp

## Version
Availability: from Vectorworks 2016
## Category
* Objects - Architectural